Autodesk.Revit.DB.Categories.Item(Autodesk.Revit.DB.BuiltInCategory)
Retrieves a category object matching an identifier.
Retrieves a category object corresponding to a BuiltInCategory id.
Remarks:  Unlike the method that obtains categories by name, this routine will obtain
the handle even of built-in subcategories.